app/Controllers/Admin/BukuController.php

SELECT *
FROM `kategori`
---
    public function create(): string
    {
        $data = [
            'title'      => 'Tambah Buku',
            'categories' => $this->kategoriModel->findAll()

SELECT *
FROM `kategori`
---
    public function edit(int $id): string|\CodeIgniter\HTTP\RedirectResponse
    {
        $buku = $this->bukuModel->find($id);
        if (!$buku) {
            return redirect()->to('/admin/buku')->with('error', 'Buku tidak ditemukan.');
        }
        $data = [
            'title'      => 'Edit Buku',
            'book'       => $buku,
            'categories' => $this->kategoriModel->findAll()