app/Controllers/Admin/BukuController.php

SELECT `buku`.*, `kategori`.`nama_kategori`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id` = `buku`.`category_id`
ORDER BY `buku`.`created_at` DESC
SELECT *
FROM `buku`
ORDER BY `created_at` DESC
---
    public function index(): string
    {
        $data = [
            'title' => 'Kelola Buku',
            'buku' => $this->bukuModel->orderBy('created_at', 'DESC')->findAll(),
        ];

INSERT INTO `buku` (`title`, `author`, `isbn`, `description`, `stock`, `status`, `created_at`, `updated_at`) VALUES ('Hary Poter', 'JK Rowling', '887619', 'Fiksi', 100, 'available', '2026-04-24 13:18:49', '2026-04-24 13:18:49')
---
    public function store(): \CodeIgniter\HTTP\RedirectResponse
    {
        $rules = [
            'title'  => 'required|min_length[3]|max_length[200]',
            'author' => 'required|min_length[3]|max_length[150]',
            'stock'  => 'required|integer|greater_than_equal_to[1]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->bukuModel->insert([
            'title'       => $this->request->getPost('title'),
            'author'      => $this->request->getPost('author'),
            'isbn'        => $this->request->getPost('isbn'),
            'description' => $this->request->getPost('description'),
            'stock'       => (int) $this->request->getPost('stock'),
            'status'      => 'available',
        ]);

SELECT *
FROM `buku`
WHERE `buku`.`id` = 7
---
    public function edit(int $id): string|\CodeIgniter\HTTP\RedirectResponse
    {
        $buku = $this->bukuModel->find($id);

UPDATE `buku` SET `category_id` = '2', `title` = 'Dilan 1990', `author` = 'Pidi Baiq', `isbn` = '978-602-6682-00-1', `description` = 'Kisah cinta remaja di Bandung tahun 1990-an yang penuh kenangan.', `stock` = 5, `status` = 'available', `updated_at` = '2026-04-25 02:22:15'
WHERE `buku`.`id` IN (4)
---
    public function update(int $id): \CodeIgniter\HTTP\RedirectResponse
    {
        $rules = [
            'title'  => 'required|min_length[3]|max_length[200]',
            'author' => 'required|min_length[3]|max_length[150]',
            'stock'  => 'required|integer|greater_than_equal_to[0]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $stock = (int) $this->request->getPost('stock');
        $this->bukuModel->update($id, [
            'title'       => $this->request->getPost('title'),
            'author'      => $this->request->getPost('author'),
            'isbn'        => $this->request->getPost('isbn'),
            'description' => $this->request->getPost('description'),
            'stock'       => $stock,
            'status'      => $stock > 0 ? 'available' : 'unavailable',
        ]);