app/Controllers/Admin/DashboardController.php

SELECT COUNT(*) AS `numrows` FROM `books`
SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'
---
    public function index(): string
    {
        $data = [
            'title'          => 'Dashboard Admin',
            'totalBooks'     => $this->bukuModel->countAll(),
            'totalUsers'     => $this->userModel->where('role', 'user')->countAllResults(),