app/Controllers/Admin/KategoriController.php

    public function index()
    {
        $data = [
            'title'    => 'Kelola Kategori Buku',
            'kategori' => $this->kategoriModel->findAll()
---
SELECT *
FROM `kategori`