app/Controllers/Admin/UserController.php

SELECT *
FROM `users`
ORDER BY `created_at` DESC
---
    public function index(): string
    {
        $data = [
            'title' => 'Kelola Pengguna',
            'users' => $this->userModel->orderBy('created_at', 'DESC')->findAll(),