app/Models/PinjamModel.php

    public function getBorrowingsWithDetails(): array
    {
        return $this->select('pinjam.*, users.name as user_name, users.username, buku.title as book_title, buku.author')
                    ->join('users', 'users.id = pinjam.user_id')
                    ->join('buku', 'buku.id = pinjam.book_id')
                    ->orderBy('pinjam.created_at', 'DESC')
                    ->findAll();
---
SELECT `pinjam`.*, `users`.`name` as `user_name`, `users`.`username`, `buku`.`title` as `book_title`, `buku`.`author`
FROM `pinjam`
JOIN `users` ON `users`.`id` = `pinjam`.`user_id`
JOIN `buku` ON `buku`.`id` = `pinjam`.`book_id`
ORDER BY `pinjam`.`created_at` DESC

    public function countActive(): int
    {
        return $this->where('status', 'borrowed')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pinjam`
WHERE `status` = 'borrowed'