app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function findByUsername(string $username): ?array
    {
        return $this->where('username', $username)->first();